Autodesk.Revit.DB.IEntitlementExternalServerProxy.EnsureToEnableCloudWorksharing
Shows a dialog for users to ensure if user really wants to enable cloud worksharing.
Returns:
Indicates whether the user really wants to enable cloud worksharing.
Since:
2019

Autodesk.Revit.DB.IEntitlementExternalServerProxy.ShowNoWorksharedCloudModelEntitlementWindow
Shows a dialog saying "You don't have access of Workshared Cloud Model entitlement".
Since:
2019

Autodesk.Revit.DB.IEntitlementExternalServerProxy.HasCloudModelEntitlement
Checks if the current user has Non-workshared Cloud Model entitlement.
Returns:
Indicates whether the current user has Non-workshared Cloud Model entitlement
Since:
2019

Autodesk.Revit.DB.IEntitlementExternalServerProxy.HasWorksharedCloudModelEntitlement
Checks if the current user has Workshared Cloud Model entitlement.
Returns:
Indicates whether the current user has Workshared Cloud Model entitlement
Since:
2019